src/ЗУП/cfe/рг_УниверсальныйОбменXML/Catalogs/рг_НастройкиОбменаXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рг_НастройкиОбменаXML</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБазыПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОбменаДанными</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаПравил</Name>
					<Comment>deprecated (v2)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ЗУП/cfe/рг_УниверсальныйОбменXML/CommonModules/рг_УниверсальныйОбменXMLСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс



// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++



// +++ Вдовин П.Ю. 25.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище



// Точка входа регламентного задания обмена по профилю-приёмнику.

//

// Параметры:

//   Профиль - СправочникСсылка.рг_НастройкиОбменаXML - профиль обмена.

//

Процедура ВыполнитьОбменПоПрофилю(Профиль) Экспорт

	

	Если НЕ ЗначениеЗаполнено(Профиль) Тогда

		

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Предупреждение,

			,

			НСтр("ru = 'Профиль не задан'"));

		Возврат;

		

	КонецЕсли;

	

	РезультатСеанса = ВыполнитьСеансОбменаПоПрофилюПриемника(Профиль);

	

	Если РезультатСеанса.Успех Тогда

		

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Информация,

			Профиль,

			НСтр("ru = 'Регламентный обмен по профилю выполнен успешно'"));

		

	Иначе

		

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Ошибка,

			Профиль,

			РезультатСеанса.СообщениеОбОшибке);

		

	КонецЕсли;

	

КонецПроцедуры



// Находит единственный профиль-источник по паре префиксов.

//

// Параметры:

//   Префикс - Строка - префикс базы-источника.

//   ПрефиксБазыПриемника - Строка - префикс базы-приёмника.

//

// Возвращаемое значение:

//   СправочникСсылка.рг_НастройкиОбменаXML - профиль-источник.

//

Функция НайтиЕдинственныйПрофильИсточникаПоПрефиксам(Префикс, ПрефиксБазыПриемника) Экспорт

	

	Запрос = Новый Запрос;

	Запрос.Текст =

	"ВЫБРАТЬ

	|	НастройкиОбменаXML.Ссылка КАК Ссылка

	|ИЗ

	|	Справочник.рг_НастройкиОбменаXML КАК НастройкиОбменаXML

	|ГДЕ

	|	НастройкиОбменаXML.Источник = ИСТИНА

	|	И НастройкиОбменаXML.Префикс = &Префикс

	|	И НастройкиОбменаXML.ПрефиксБазыПриемника = &ПрефиксБазыПриемника";

	

	Запрос.УстановитьПараметр("Префикс", Префикс);

	Запрос.УстановитьПараметр("ПрефиксБазыПриемника", ПрефиксБазыПриемника);

	

	Выборка = Запрос.Выполнить().Выбрать();

	

	Если НЕ Выборка.Следующий() Тогда

		

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

			НСтр("ru = 'Профиль-источник не найден по префиксам ""%1"" / ""%2"".'"),

			Префикс,

			ПрефиксБазыПриемника);

		ЗаписатьСобытиеОбмена(УровеньЖурналаРегистрации.Ошибка, , ТекстОшибки);

		ВызватьИсключение ТекстОшибки;

		

	КонецЕсли;

	

	Профиль = Выборка.Ссылка;

	

	Если Выборка.Следующий() Тогда

		

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

			НСтр("ru = 'Найдено более одного профиля-источника по префиксам ""%1"" / ""%2"".'"),

			Префикс,

			ПрефиксБазыПриемника);

		ЗаписатьСобытиеОбмена(УровеньЖурналаРегистрации.Ошибка, , ТекстОшибки);

		ВызватьИсключение ТекстОшибки;

		

	КонецЕсли;

	

	Возврат Профиль;

	

КонецФункции



// Формирует ZIP-пакет выгрузки для операции GetData.

//

// Параметры:

//   Префикс - Строка - префикс базы-источника.

//   ПрефиксБазыПриемника - Строка - префикс базы-приёмника.

//

// Возвращаемое значение:

//   ДвоичныеДанные - ZIP с XML правил и XML данных.

//

Функция ПолучитьДанныеОбмена(Префикс, ПрефиксБазыПриемника) Экспорт

	

	ПрофильИсточника = НайтиЕдинственныйПрофильИсточникаПоПрефиксам(Префикс, ПрефиксБазыПриемника);

	НачатьВыгрузкуGetData(ПрофильИсточника);

	

	Попытка

		

		Возврат ВыполнитьФазуВыгрузкиGetData(ПрофильИсточника);

		

	Исключение

		

		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		УстановитьСтатусПрофиляИсточника(

			ПрофильИсточника,

			СтатусОшибка(),

			ТекстОшибки);

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Ошибка,

			ПрофильИсточника,

			ТекстОшибки);

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецФункции



// Подтверждает успешную загрузку данных на приёмнике.

//

// Параметры:

//   Префикс - Строка - префикс базы-источника.

//   ПрефиксБазыПриемника - Строка - префикс базы-приёмника.

//

// Возвращаемое значение:

//   Строка - признак успешного подтверждения.

//

Функция ПодтвердитьПолучениеДанных(Префикс, ПрефиксБазыПриемника) Экспорт

	

	ПрофильИсточника = НайтиЕдинственныйПрофильИсточникаПоПрефиксам(Префикс, ПрефиксБазыПриемника);

	ТекущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрофильИсточника, "Статус");

	

	Если ТекущийСтатус = СтатусВыполнено() Тогда

		Возврат НСтр("ru = 'OK'");

	КонецЕсли;

	

	Если ТекущийСтатус <> СтатусВыполняется() Тогда

		

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

			НСтр("ru = 'Подтверждение получения данных недоступно для статуса ""%1"".'"),

			ПредставлениеСтатуса(ТекущийСтатус));

		ЗаписатьСобытиеОбмена(УровеньЖурналаРегистрации.Ошибка, ПрофильИсточника, ТекстОшибки);

		ВызватьИсключение ТекстОшибки;

		

	КонецЕсли;

	

	УстановитьСтатусПрофиляИсточника(

		ПрофильИсточника,

		СтатусВыполнено(),

		НСтр("ru = 'Подтверждено получение данных на приёмнике'"));

	

	Возврат НСтр("ru = 'OK'");

	

КонецФункции



// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище



// Возвращает код статуса «не готов к обмену».

//

// Возвращаемое значение:

//   Строка - пустая строка.

//

Функция СтатусНеГотов() Экспорт

	

	Возврат "";

	

КонецФункции



// Возвращает код статуса «готов к обмену».

//

// Возвращаемое значение:

//   Строка - код "Новое".

//

Функция СтатусНовое() Экспорт

	

	Возврат "Новое";

	

КонецФункции



// Возвращает код статуса «идёт обмен».

//

// Возвращаемое значение:

//   Строка - код "Выполняется".

//

Функция СтатусВыполняется() Экспорт

	

	Возврат "Выполняется";

	

КонецФункции



// Возвращает код статуса «обмен завершён».

//

// Возвращаемое значение:

//   Строка - код "Выполнено".

//

Функция СтатусВыполнено() Экспорт

	

	Возврат "Выполнено";

	

КонецФункции



// Возвращает код статуса «ошибка обмена».

//

// Возвращаемое значение:

//   Строка - код "Ошибка".

//

Функция СтатусОшибка() Экспорт

	

	Возврат "Ошибка";

	

КонецФункции



// Возвращает UX-подпись для кода статуса профиля-источника.

//

// Параметры:

//   Код - Строка - код статуса (см. функции Статус*()).

//

// Возвращаемое значение:

//   Строка - подпись для отображения пользователю.

//

Функция ПредставлениеСтатуса(Код) Экспорт

	

	Если Код = СтатусНеГотов() Тогда

		Возврат НСтр("ru = 'Не готов к обмену'");

	ИначеЕсли Код = СтатусНовое() Тогда

		Возврат НСтр("ru = 'Готов к обмену'");

	ИначеЕсли Код = СтатусВыполняется() Тогда

		Возврат НСтр("ru = 'Идёт обмен'");

	ИначеЕсли Код = СтатусВыполнено() Тогда

		Возврат НСтр("ru = 'Обмен завершён'");

	ИначеЕсли Код = СтатусОшибка() Тогда

		Возврат НСтр("ru = 'Ошибка обмена'");

	КонецЕсли;

	

	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

		НСтр("ru = 'Неизвестный код статуса обмена: ""%1"".'"),

		Код);

	

КонецФункции



// Наполняет список значений парами код — подпись статуса.

//

// Параметры:

//   СписокЗначений - СписокЗначений - список для наполнения.

//

Процедура ЗаполнитьСписокСтатусов(СписокЗначений) Экспорт

	

	СписокЗначений.Очистить();

	СписокЗначений.Добавить(СтатусНеГотов(), ПредставлениеСтатуса(СтатусНеГотов()));

	СписокЗначений.Добавить(СтатусНовое(), ПредставлениеСтатуса(СтатусНовое()));

	СписокЗначений.Добавить(СтатусВыполняется(), ПредставлениеСтатуса(СтатусВыполняется()));

	СписокЗначений.Добавить(СтатусВыполнено(), ПредставлениеСтатуса(СтатусВыполнено()));

	СписокЗначений.Добавить(СтатусОшибка(), ПредставлениеСтатуса(СтатусОшибка()));

	

КонецПроцедуры



// --- Вдовин П.Ю.



// Выполняет полный сеанс обмена на стороне приёмника.

//

// Параметры:

//   ПрофильПриемника - СправочникСсылка.рг_НастройкиОбменаXML - профиль-приёмник.

//

// Возвращаемое значение:

//   Структура - поля Успех (Булево), СообщениеОбОшибке (Строка).

//

Функция ВыполнитьСеансОбменаПоПрофилюПриемника(ПрофильПриемника) Экспорт

	

	Результат = Новый Структура("Успех, СообщениеОбОшибке", Ложь, "");

	

	Попытка

		

		ДанныеСеансаОбмена = ПодготовитьДанныеСеансаПриемника(ПрофильПриемника);

		АрхивДанных = ВызватьGetDataНаИсточнике(ДанныеСеансаОбмена);

		ЗагрузитьДанныеИзАрхива(АрхивДанных);

		ВызватьConfirmDataReceiptНаИсточнике(ДанныеСеансаОбмена);

		

		Результат.Успех = Истина;

		

	Исключение

		// +++ Вдовин П.Ю. 26.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище

		Информация = ИнформацияОбОшибке();

		ПолныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация);

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Ошибка,

			ПрофильПриемника,

			ПолныйТекстОшибки);

		Результат.СообщениеОбОшибке = ТекстОшибкиВебСервисаДляПользователя(Информация, ПрофильПриемника);

		// --- ВдовинПЮ

	КонецПопытки;

	

	Возврат Результат;

	

КонецФункции



// --- ВдовинПЮ



// ВдовинПЮ: ---



#КонецОбласти



#Область СлужебныеПроцедурыИФункции



// +++ Вдовин П.Ю. 25.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище



Функция ИмяФайлаПравилВАрхиве()

	

	Возврат "ExchangeRules.xml";

	

КонецФункции



Функция ИмяФайлаДанныхВАрхиве()

	

	Возврат "ExchangeData.xml";

	

КонецФункции



Функция URIПространстваИменСервисаОбмена()

	

	Возврат "http://localhost/test_zup/ws/";

	

КонецФункции



Функция ИмяСервисаОбмена()

	

	Возврат "rgExchangeService";

	

КонецФункции



// +++ Вдовин П.Ю. 26.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище



// Формирует префикс пары префиксов профиля для текста журнала регистрации.

//

// Параметры:

//   Профиль - СправочникСсылка.рг_НастройкиОбменаXML - профиль обмена.

//

// Возвращаемое значение:

//   Строка - префикс вида "[ИСТ/ПРИЕМ] " или пустая строка, если профиль не задан.

//

Функция ПрефиксПрофиляДляТекстаЖурнала(Профиль)

	

	Если НЕ ЗначениеЗаполнено(Профиль) Тогда

		Возврат "";

	КонецЕсли;

	

	РеквизитыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(

		Профиль,

		"Префикс, ПрефиксБазыПриемника");

	

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

		"[%1/%2] ",

		РеквизитыПрофиля.Префикс,

		РеквизитыПрофиля.ПрефиксБазыПриемника);

	

КонецФункции



Процедура ЗаписатьСобытиеОбмена(Уровень, Профиль = Неопределено, ТекстСообщения = "")

	

	ПрефиксТекста = ПрефиксПрофиляДляТекстаЖурнала(Профиль);

	ТекстДляЖурнала = ТекстСообщения;

	

	Если НЕ ПустаяСтрока(ПрефиксТекста)

		И НЕ СтрНачинаетсяС(ТекстДляЖурнала, ПрефиксТекста) Тогда

		

		ТекстДляЖурнала = ПрефиксТекста + ТекстДляЖурнала;

		

	КонецЕсли;

	

	ЗаписьЖурналаРегистрации(

		"рг.УниверсальныйОбменXML",

		Уровень,

		Метаданные.Справочники.рг_НастройкиОбменаXML,

		Профиль,

		ТекстДляЖурнала);

	

КонецПроцедуры



// Проверяет, что строка ошибки не содержит нечитаемых фрагментов (подряд «?»).

//

// Параметры:

//   Строка - Строка - проверяемый текст.

//

// Возвращаемое значение:

//   Булево - Истина, если строка пригодна для показа пользователю.

//

Функция СтрокаОшибкиВебСервисаЧитаема(Строка)

	

	Если ПустаяСтрока(Строка) Тогда

		Возврат Ложь;

	КонецЕсли;

	

	Возврат СтрНайти(Строка, "??") = 0;

	

КонецФункции



// Определяет, является ли строка служебной обёрткой платформы или WS.

//

// Параметры:

//   Строка - Строка - проверяемый текст.

//

// Возвращаемое значение:

//   Булево - Истина, если строка — обёртка без бизнес-смысла.

//

Функция СтрокаСлужебнаяОбёрткаОшибкиВебСервиса(Строка)

	

	СтрокаНижнийРегистр = НРег(СокрЛП(Строка));

	

	Если СтрНачинаетсяС(СтрокаНижнийРегистр, "при вызове веб-сервиса") Тогда

		Возврат Истина;

	КонецЕсли;

	

	Если СтрНачинаетсяС(СтрокаНижнийРегистр, "ошибка soap сервера") Тогда

		Возврат Истина;

	КонецЕсли;

	

	Если СтрНачинаетсяС(СтрокаНижнийРегистр, "ошибка при вызове метода контекста") Тогда

		Возврат Истина;

	КонецЕсли;

	

	Возврат Ложь;

	

КонецФункции



// Удаляет из текста блоки вида {…Модуль(число)}.

//

// Параметры:

//   Текст - Строка - исходный текст ошибки.

//

// Возвращаемое значение:

//   Строка - текст без блоков модуля платформы.

//

Функция УдалитьБлокиМодуляИзТекстаОшибкиВебСервиса(Текст)

	

	Результат = Текст;

	НачалоБлока = СтрНайти(Результат, "{");

	

	Пока НачалоБлока > 0 Цикл

		

		КонецБлока = СтрНайти(Результат, "}", , НачалоБлока);

		

		Если КонецБлока = 0 Тогда

			Прервать;

		КонецЕсли;

		

		ФрагментБлока = Сред(Результат, НачалоБлока, КонецБлока - НачалоБлока + 1);

		

		Если СтрНайти(ФрагментБлока, "Модуль(") > 0 Тогда

			Результат = Лев(Результат, НачалоБлока - 1) + Сред(Результат, КонецБлока + 1);

		Иначе

			НачалоБлока = СтрНайти(Результат, "{", , КонецБлока + 1);

			Продолжить;

		КонецЕсли;

		

		НачалоБлока = СтрНайти(Результат, "{");

		

	КонецЦикла;

	

	Результат = СокрЛП(Результат);

	

	Если СтрНачинаетсяС(Результат, ":") Тогда

		Результат = СокрЛП(Сред(Результат, 2));

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции



// Разбивает текст ошибки по маркеру «по причине:» (внутренние причины — первыми).

//

// Параметры:

//   Текст - Строка - исходный текст.

//

// Возвращаемое значение:

//   Массив - фрагменты от внутренней причины к внешней.

//

Функция РазделитьТекстОшибкиПоМаркеруПричины(Текст)

	

	Маркер = "по причине:";

	ДлинаМаркера = СтрДлина(Маркер);

	Части = Новый Массив;

	Остаток = Текст;

	

	Пока Истина Цикл

		

		Позиция = СтрНайти(НРег(Остаток), Маркер);

		

		Если Позиция = 0 Тогда

			

			Если НЕ ПустаяСтрока(СокрЛП(Остаток)) Тогда

				Части.Добавить(Остаток);

			КонецЕсли;

			

			Прервать;

			

		КонецЕсли;

		

		Части.Добавить(СокрЛП(Сред(Остаток, Позиция + ДлинаМаркера)));

		Остаток = СокрЛП(Лев(Остаток, Позиция - 1));

		

	КонецЦикла;

	

	Возврат Части;

	

КонецФункции



// Нормализует кандидат строки ошибки: убирает обёртки и блоки модуля.

//

// Параметры:

//   Строка - Строка - фрагмент описания ошибки.

//

// Возвращаемое значение:

//   Строка - читаемый бизнес-текст или пустая строка.

//

Функция НормализоватьСтрокуКандидатаОшибкиВебСервиса(Строка)

	

	Результат = УдалитьБлокиМодуляИзТекстаОшибкиВебСервиса(Строка);

	Результат = СокрЛП(Результат);

	

	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище

	

	Пока СтрокаСлужебнаяОбёрткаОшибкиВебСервиса(Результат) Цикл

		

		ПозицияДвоеточия = СтрНайти(Результат, ":");

		

		Если ПозицияДвоеточия > 0 Тогда

			Результат = СокрЛП(Сред(Результат, ПозицияДвоеточия + 1));

		Иначе

			Результат = "";

			Прервать;

		КонецЕсли;

		

	КонецЦикла;

	

	// --- ВдовинПЮ

	

	Если ПустаяСтрока(Результат)

		ИЛИ НЕ СтрокаОшибкиВебСервисаЧитаема(Результат)

		ИЛИ СтрокаСлужебнаяОбёрткаОшибкиВебСервиса(Результат) Тогда

		Возврат "";

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции



// Извлекает первую читаемую бизнес-строку из описания ошибки.

//

// Параметры:

//   Описание - Строка - текст .Описание из ИнформацияОбОшибке.

//

// Возвращаемое значение:

//   Строка - бизнес-текст или пустая строка.

//

Функция ИзвлечьЧитаемуюБизнесСтрокуИзОписанияОшибкиВебСервиса(Описание)

	

	Если ПустаяСтрока(Описание) Тогда

		Возврат "";

	КонецЕсли;

	

	ЧастиПоПричине = РазделитьТекстОшибкиПоМаркеруПричины(Описание);

	

	Для Каждого Часть Из ЧастиПоПричине Цикл

		

		Строки = СтрРазделить(Часть, Символы.ПС, Ложь);

		

		Для Каждого Строка Из Строки Цикл

			

			Кандидат = НормализоватьСтрокуКандидатаОшибкиВебСервиса(Строка);

			

			Если НЕ ПустаяСтрока(Кандидат) Тогда

				Возврат Кандидат;

			КонецЕсли;

			

		КонецЦикла;

		

	КонецЦикла;

	

	Возврат "";

	

КонецФункции



// Извлекает бизнес-текст ошибки веб-сервиса для показа пользователю.

//

// Параметры:

//   ИнформацияОбОшибке - ИнформацияОбОшибке - сведения об исключении.

//   Профиль - СправочникСсылка.рг_НастройкиОбменаXML - профиль обмена; префикс пары добавляется к тексту.

//

// Возвращаемое значение:

//   Строка - краткий текст без стека и служебных обёрток платформы.

//

Функция ТекстОшибкиВебСервисаДляПользователя(ИнформацияОбОшибке, Профиль = Неопределено)

	

	ЦепочкаОшибок = Новый Массив;

	ТекущаяОшибка = ИнформацияОбОшибке;

	

	Пока ТекущаяОшибка <> Неопределено Цикл

		ЦепочкаОшибок.Добавить(ТекущаяОшибка);

		ТекущаяОшибка = ТекущаяОшибка.Причина;

	КонецЦикла;

	

	ТекстСообщения = "";

	Индекс = ЦепочкаОшибок.ВГраница();

	

	Пока Индекс >= 0 Цикл

		

		Кандидат = ИзвлечьЧитаемуюБизнесСтрокуИзОписанияОшибкиВебСервиса(ЦепочкаОшибок[Индекс].Описание);

		

		Если НЕ ПустаяСтрока(Кандидат) Тогда

			ТекстСообщения = Кандидат;

			Прервать;

		КонецЕсли;

		

		Индекс = Индекс - 1;

		

	КонецЦикла;

	

	Если ПустаяСтрока(ТекстСообщения) Тогда

		ТекстСообщения = НормализоватьСтрокуКандидатаОшибкиВебСервиса(ИнформацияОбОшибке.Описание);

	КонецЕсли;

	

	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище

	

	Если ПустаяСтрока(ТекстСообщения) Тогда

		ТекстСообщения = НСтр("ru = 'Ошибка при обмене данными через веб-сервис.'");

	КонецЕсли;

	

	// --- ВдовинПЮ

	

	ПрефиксТекста = ПрефиксПрофиляДляТекстаЖурнала(Профиль);

	

	Если НЕ ПустаяСтрока(ПрефиксТекста)

		И НЕ СтрНачинаетсяС(ТекстСообщения, ПрефиксТекста) Тогда

		ТекстСообщения = ПрефиксТекста + ТекстСообщения;

	КонецЕсли;

	

	Возврат ТекстСообщения;

	

КонецФункции



// --- ВдовинПЮ



// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище



// Нормализует значение реквизита Статус в строковый код.

//

// Параметры:

//   ЗначениеСтатуса - Строка - текущее значение реквизита.

//

// Возвращаемое значение:

//   Строка - код статуса для сравнений и журнала.

//

Функция КодСтатусаПрофиля(ЗначениеСтатуса)

	

	Если ПустаяСтрока(ЗначениеСтатуса) Тогда

		Возврат СтатусНеГотов();

	КонецЕсли;

	

	Возврат ЗначениеСтатуса;

	

КонецФункции



// Проверяет код статуса и возвращает его для записи в реквизит Статус.

//

// Параметры:

//   Код - Строка - код статуса (см. функции Статус*()).

//

// Возвращаемое значение:

//   Строка - значение для записи в реквизит.

//

Функция ЗначениеСтатусаПоКоду(Код)

	

	Если ПустаяСтрока(Код) Тогда

		Возврат СтатусНеГотов();

	КонецЕсли;

	

	Если Код = СтатусНовое()

		ИЛИ Код = СтатусВыполняется()

		ИЛИ Код = СтатусВыполнено()

		ИЛИ Код = СтатусОшибка() Тогда

		Возврат Код;

	КонецЕсли;

	

	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

		НСтр("ru = 'Неизвестный код статуса обмена: ""%1"".'"),

		Код);

	

КонецФункции



// --- Вдовин П.Ю.



// Записывает объект профиля-источника после изменения только реквизита Статус.

//

// Параметры:

//   ОбъектПрофиля - СправочникОбъект.рг_НастройкиОбменаXML - объект профиля с установленным Статус.

//

Процедура ЗаписатьСтатусПрофиляИсточника(ОбъектПрофиля)

	

	УстановитьПривилегированныйРежим(Истина);

	

	Попытка

		

		ОбъектПрофиля.ОбменДанными.Загрузка = Истина;

		ОбъектПрофиля.Записать();

		

	Исключение

		

		УстановитьПривилегированныйРежим(Ложь);

		ВызватьИсключение;

		

	КонецПопытки;

	

	УстановитьПривилегированныйРежим(Ложь);

	

КонецПроцедуры



Процедура НачатьВыгрузкуGetData(ПрофильИсточника)

	

	НачатьТранзакцию();

	

	Попытка

		

		Блокировка = Новый БлокировкаДанных;

		ЭлементБлокировки = Блокировка.Добавить("Справочник.рг_НастройкиОбменаXML");

		ЭлементБлокировки.УстановитьЗначение("Ссылка", ПрофильИсточника);

		Блокировка.Заблокировать();

		

		ОбъектПрофиля = ПрофильИсточника.ПолучитьОбъект();

		

		Если ОбъектПрофиля.Статус <> СтатусНовое() Тогда

			

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

				НСтр("ru = 'Выгрузка данных недоступна: профиль в статусе ""%1"", требуется ""%2"".'"),

				ПредставлениеСтатуса(ОбъектПрофиля.Статус),

				ПредставлениеСтатуса(СтатусНовое()));

			ЗаписатьСобытиеОбмена(УровеньЖурналаРегистрации.Ошибка, ПрофильИсточника, ТекстОшибки);

			ВызватьИсключение ТекстОшибки;

			

		КонецЕсли;

		

		ОбъектПрофиля.Статус = СтатусВыполняется();

		ЗаписатьСтатусПрофиляИсточника(ОбъектПрофиля);

		

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Информация,

			ПрофильИсточника,

			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

				НСтр("ru = 'Статус профиля изменён: %1 → %2'"),

				ПредставлениеСтатуса(СтатусНовое()),

				ПредставлениеСтатуса(СтатусВыполняется())));

		

		ЗафиксироватьТранзакцию();

		

	Исключение

		

		ОтменитьТранзакцию();

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецПроцедуры



// Устанавливает статус профиля-источника по строковому коду.

//

// Параметры:

//   ПрофильИсточника - СправочникСсылка.рг_НастройкиОбменаXML - профиль-источник.

//   НовыйСтатус - Строка - код статуса (см. функции Статус*()).

//   ТекстСообщения - Строка - необязательный текст для журнала.

//

Процедура УстановитьСтатусПрофиляИсточника(ПрофильИсточника, НовыйСтатус, ТекстСообщения = "")

	

	НачатьТранзакцию();

	

	Попытка

		

		Блокировка = Новый БлокировкаДанных;

		ЭлементБлокировки = Блокировка.Добавить("Справочник.рг_НастройкиОбменаXML");

		ЭлементБлокировки.УстановитьЗначение("Ссылка", ПрофильИсточника);

		Блокировка.Заблокировать();

		

		ОбъектПрофиля = ПрофильИсточника.ПолучитьОбъект();

		ПредыдущийСтатус = ОбъектПрофиля.Статус;

		ОбъектПрофиля.Статус = ЗначениеСтатусаПоКоду(НовыйСтатус);

		ЗаписатьСтатусПрофиляИсточника(ОбъектПрофиля);

		

		Если ПустаяСтрока(ТекстСообщения) Тогда

			ТекстЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

				НСтр("ru = 'Статус профиля изменён: %1 → %2'"),

				ПредставлениеСтатуса(ПредыдущийСтатус),

				ПредставлениеСтатуса(НовыйСтатус));

		Иначе

			ТекстЖурнала = ТекстСообщения;

		КонецЕсли;

		

		ЗаписатьСобытиеОбмена(УровеньЖурналаРегистрации.Информация, ПрофильИсточника, ТекстЖурнала);

		

		ЗафиксироватьТранзакцию();

		

	Исключение

		

		ОтменитьТранзакцию();

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецПроцедуры



Функция ВыполнитьФазуВыгрузкиGetData(ПрофильИсточника)

	

	ИменаФайловВыгрузки = Неопределено;

	

	Попытка

		

		ИменаФайловВыгрузки = ВыгрузитьДанныеДвижком(ПрофильИсточника);

		ДвоичныеДанныеZip = УпаковатьВыгрузкуВZip(

			ИменаФайловВыгрузки.ИмяФайлаПравил,

			ИменаФайловВыгрузки.ИмяФайлаДанных);

		

	Исключение

		

		Если ИменаФайловВыгрузки <> Неопределено Тогда

			УдалитьВременныеФайлыИКаталоги(ИменаФайловВыгрузки.ВременныеПути);

		КонецЕсли;

		ВызватьИсключение;

		

	КонецПопытки;

	

	УдалитьВременныеФайлыИКаталоги(ИменаФайловВыгрузки.ВременныеПути);

	

	Возврат ДвоичныеДанныеZip;

	

КонецФункции



Функция ВыгрузитьДанныеДвижком(ПрофильИсточника)

	

	РеквизитыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(

		ПрофильИсточника,

		"ПравилаОбменаДанными");

	

	ИмяФайлаПравил = ЗаписатьПравилаОбменаВоВременныйФайл(РеквизитыПрофиля.ПравилаОбменаДанными);

	ИмяФайлаДанных = ПолучитьИмяВременногоФайла("xml");

	

	ВременныеПути = Новый Массив;

	ВременныеПути.Добавить(ИмяФайлаПравил);

	ВременныеПути.Добавить(ИмяФайлаДанных);

	

	Движок = Обработки.рг_УниверсальныйОбменДаннымиXML.Создать();

	

	Попытка

		

		Движок.ИмяФайлаПравилОбмена = ИмяФайлаПравил;

		НастроитьПротоколДвижкаОбмена(Движок, ВременныеПути);

		Движок.ЗагрузитьПравилаОбмена();

		ВызватьИсключениеПриОшибкеДвижкаОбмена(

			Движок,

			НСтр("ru = 'Ошибка при загрузке правил обмена.'"),

			ВременныеПути,

			ПрофильИсточника);

		Движок.ИнициализироватьПервоначальныеЗначенияПараметров();

		

		ПараметрыПрофиля = ПараметрыПрофиляИсточника(ПрофильИсточника);

		

		Для Каждого СтрокаПараметра Из ПараметрыПрофиля Цикл

			Движок.УстановитьЗначениеПараметраВТаблице(

				СтрокаПараметра.ИмяПараметра,

				СтрокаПараметра.ЗначениеПараметра);

		КонецЦикла;

		

		Движок.ИмяФайлаОбмена = ИмяФайлаДанных;

		Движок.ВыполнитьВыгрузку();

		ВызватьИсключениеПриОшибкеДвижкаОбмена(

			Движок,

			НСтр("ru = 'Движок обмена завершил выгрузку с ошибками.'"),

			ВременныеПути,

			ПрофильИсточника);

		

		ФайлДанных = Новый Файл(ИмяФайлаДанных);

		

		Если НЕ ФайлДанных.Существует() ИЛИ ФайлДанных.Размер() = 0 Тогда

			ВызватьИсключение НСтр("ru = 'Движок обмена не сформировал файл данных выгрузки.'");

		КонецЕсли;

		

		Движок.ЗавершитьВедениеПротоколаОбмена();

		

		Результат = Новый Структура;

		Результат.Вставить("ИмяФайлаПравил", ИмяФайлаПравил);

		Результат.Вставить("ИмяФайлаДанных", ИмяФайлаДанных);

		Результат.Вставить("ВременныеПути", ВременныеПути);

		

		Возврат Результат;

		

	Исключение

		

		УдалитьВременныеФайлыИКаталоги(ВременныеПути);

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецФункции



Функция ПараметрыПрофиляИсточника(ПрофильИсточника)

	

	Запрос = Новый Запрос;

	Запрос.Текст =

	"ВЫБРАТЬ

	|	Параметры.ИмяПараметра КАК ИмяПараметра,

	|	Параметры.ЗначениеПараметра КАК ЗначениеПараметра

	|ИЗ

	|	Справочник.рг_НастройкиОбменаXML.Параметры КАК Параметры

	|ГДЕ

	|	Параметры.Ссылка = &Профиль";

	

	Запрос.УстановитьПараметр("Профиль", ПрофильИсточника);

	

	Возврат Запрос.Выполнить().Выгрузить();

	

КонецФункции



Функция ЗаписатьПравилаОбменаВоВременныйФайл(ПравилаОбменаДанными)

	

	Если НЕ ЗначениеЗаполнено(ПравилаОбменаДанными) Тогда

		ВызватьИсключение НСтр("ru = 'В профиле-источнике не заданы правила обмена.'");

	КонецЕсли;

	

	СодержимоеПравил = ПравилаОбменаДанными.Получить();

	ИмяФайлаПравил = ПолучитьИмяВременногоФайла("xml");

	

	Если ТипЗнч(СодержимоеПравил) = Тип("Строка") Тогда

		

		ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаПравил, КодировкаТекста.UTF8);

		ЗаписьТекста.Записать(СодержимоеПравил);

		ЗаписьТекста.Закрыть();

		

	ИначеЕсли ТипЗнч(СодержимоеПравил) = Тип("ДвоичныеДанные") Тогда

		

		СодержимоеПравил.Записать(ИмяФайлаПравил);

		

	Иначе

		

		ВызватьИсключение НСтр("ru = 'Неподдерживаемый формат правил обмена в хранилище профиля.'");

		

	КонецЕсли;

	

	Возврат ИмяФайлаПравил;

	

КонецФункции



Функция УпаковатьВыгрузкуВZip(ИмяФайлаПравил, ИмяФайлаДанных)

	

	КаталогАрхива = ПолучитьИмяВременногоФайла("");

	СоздатьКаталог(КаталогАрхива);

	

	ИмяПравилВКаталоге = ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(КаталогАрхива)

		+ ИмяФайлаПравилВАрхиве();

	ИмяДанныхВКаталоге = ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(КаталогАрхива)

		+ ИмяФайлаДанныхВАрхиве();

	

	КопироватьФайл(ИмяФайлаПравил, ИмяПравилВКаталоге);

	КопироватьФайл(ИмяФайлаДанных, ИмяДанныхВКаталоге);

	

	ИмяZip = ПолучитьИмяВременногоФайла("zip");

	МаскаФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(КаталогАрхива) + "*.xml";

	

	Если НЕ ОбменДаннымиСервер.ЗапаковатьВZipФайл(ИмяZip, МаскаФайлов) Тогда

		УдалитьВременныеФайлыИКаталоги(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КаталогАрхива));

		ВызватьИсключение НСтр("ru = 'Не удалось упаковать файлы выгрузки в ZIP-архив.'");

	КонецЕсли;

	

	ДвоичныеДанныеZip = Новый ДвоичныеДанные(ИмяZip);

	УдалитьФайлы(ИмяZip);

	УдалитьФайлы(КаталогАрхива);

	

	Возврат ДвоичныеДанныеZip;

	

КонецФункции



Функция ПодготовитьДанныеСеансаПриемника(ПрофильПриемника)

	

	РеквизитыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(

		ПрофильПриемника,

		"АдресСервиса, Логин, Префикс, ПрефиксБазыПриемника, Источник");

	

	Если РеквизитыПрофиля.Источник Тогда

		ВызватьИсключение НСтр("ru = 'Сеанс обмена на приёмнике доступен только для профиля с ролью приёмника.'");

	КонецЕсли;

	

	УстановитьПривилегированныйРежим(Истина);

	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ПрофильПриемника, "Пароль");

	УстановитьПривилегированныйРежим(Ложь);

	

	ДанныеСеансаОбмена = Новый Структура;

	ДанныеСеансаОбмена.Вставить("ПрофильПриемника", ПрофильПриемника);

	ДанныеСеансаОбмена.Вставить("АдресСервиса", РеквизитыПрофиля.АдресСервиса);

	ДанныеСеансаОбмена.Вставить("Логин", РеквизитыПрофиля.Логин);

	ДанныеСеансаОбмена.Вставить("Пароль", Пароль);

	ДанныеСеансаОбмена.Вставить("Префикс", РеквизитыПрофиля.Префикс);

	ДанныеСеансаОбмена.Вставить("ПрефиксБазыПриемника", РеквизитыПрофиля.ПрефиксБазыПриемника);

	

	Возврат ДанныеСеансаОбмена;

	

КонецФункции



Функция ВызватьGetDataНаИсточнике(ДанныеСеансаОбмена)

	

	Прокси = СоздатьПроксиОбмена(ДанныеСеансаОбмена);

	

	Попытка

		

		Возврат Прокси.GetData(ДанныеСеансаОбмена.Префикс, ДанныеСеансаОбмена.ПрефиксБазыПриемника);

		

	Исключение

		

		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Ошибка,

			ДанныеСеансаОбмена.ПрофильПриемника,

			ТекстОшибки);

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецФункции



Процедура ВызватьConfirmDataReceiptНаИсточнике(ДанныеСеансаОбмена)

	

	Прокси = СоздатьПроксиОбмена(ДанныеСеансаОбмена);

	

	Попытка

		

		Прокси.ConfirmDataReceipt(ДанныеСеансаОбмена.Префикс, ДанныеСеансаОбмена.ПрефиксБазыПриемника);

		

	Исключение

		

		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ЗаписатьСобытиеОбмена(

			УровеньЖурналаРегистрации.Ошибка,

			ДанныеСеансаОбмена.ПрофильПриемника,

			ТекстОшибки);

		ВызватьИсключение;

		

	КонецПопытки;

	

КонецПроцедуры



Функция СоздатьПроксиОбмена(ДанныеСеансаОбмена)

	

	ПараметрыПодключения = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();

	ПараметрыПодключения.АдресWSDL = АдресWSDLСервисаОбмена(ДанныеСеансаОбмена.АдресСервиса);

	ПараметрыПодключения.URIПространстваИмен = URIПространстваИменСервисаОбмена();

	ПараметрыПодключения.ИмяСервиса = ИмяСервисаОбмена();

	ПараметрыПодключения.ИмяПользователя = ДанныеСеансаОбмена.Логин;

	ПараметрыПодключения.Пароль = ДанныеСеансаОбмена.Пароль;

	ПараметрыПодключения.Местоположение = МестоположениеСервисаОбмена(ДанныеСеансаОбмена.АдресСервиса);

	ПараметрыПодключения.Таймаут = 600;

	

	Возврат ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);

	

КонецФункции



Функция АдресWSDLСервисаОбмена(АдресСервиса)

	

	БазовыйАдрес = СокрЛП(АдресСервиса);

	

	Если СтрЗаканчиваетсяНа(НРег(БазовыйАдрес), "?wsdl") Тогда

		Возврат БазовыйАдрес;

	КонецЕсли;

	

	Если СтрЗаканчиваетсяНа(НРег(БазовыйАдрес), ".1cws") Тогда

		Возврат БазовыйАдрес + "?wsdl";

	КонецЕсли;

	

	Возврат ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(БазовыйАдрес)

		+ "ws/" + ИмяСервисаОбмена() + "?wsdl";

	

КонецФункции



Функция МестоположениеСервисаОбмена(АдресСервиса)

	

	БазовыйАдрес = СокрЛП(АдресСервиса);

	

	Если СтрЗаканчиваетсяНа(НРег(БазовыйАдрес), "?wsdl") Тогда

		Возврат Лев(БазовыйАдрес, СтрДлина(БазовыйАдрес) - СтрДлина("?wsdl"));

	КонецЕсли;

	

	Если СтрЗаканчиваетсяНа(НРег(БазовыйАдрес), ".1cws") Тогда

		Возврат БазовыйАдрес;

	КонецЕсли;

	

	Возврат ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(БазовыйАдрес)

		+ "ws/" + ИмяСервисаОбмена();

	

КонецФункции



Процедура ЗагрузитьДанныеИзАрхива(АрхивДанных)

	

	ИмяZip = ПолучитьИмяВременногоФайла("zip");

	КаталогРаспаковки = ПолучитьИмяВременногоФайла("");

	ВременныеПути = Новый Массив;

	ВременныеПути.Добавить(ИмяZip);

	ВременныеПути.Добавить(КаталогРаспаковки);

	

	Попытка

		

		АрхивДанных.Записать(ИмяZip);

		СоздатьКаталог(КаталогРаспаковки);

		

		Если НЕ ОбменДаннымиСервер.РаспаковатьZipФайл(ИмяZip, КаталогРаспаковки) Тогда

			ВызватьИсключение НСтр("ru = 'Не удалось распаковать ZIP-архив данных обмена.'");

		КонецЕсли;

		

		ИмяФайлаПравил = ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(КаталогРаспаковки)

			+ ИмяФайлаПравилВАрхиве();

		ИмяФайлаДанных = ОбщегоНазначенияКлиентСервер.ДобавитьКонецРазделителяПути(КаталогРаспаковки)

			+ ИмяФайлаДанныхВАрхиве();

		

		ФайлПравил = Новый Файл(ИмяФайлаПравил);

		ФайлДанных = Новый Файл(ИмяФайлаДанных);

		

		Если НЕ ФайлПравил.Существует() Тогда

			ВызватьИсключение НСтр("ru = 'В архиве отсутствует файл правил обмена ExchangeRules.xml.'");

		КонецЕсли;

		

		Если НЕ ФайлДанных.Существует() Тогда

			ВызватьИсключение НСтр("ru = 'В архиве отсутствует файл данных обмена ExchangeData.xml.'");

		КонецЕсли;

		

		Движок = Обработки.рг_УниверсальныйОбменДаннымиXML.Создать();

		Движок.ИмяФайлаПравилОбмена = ИмяФайлаПравил;

		Движок.ИмяФайлаОбмена = ИмяФайлаДанных;

		НастроитьПротоколДвижкаОбмена(Движок, ВременныеПути);

		Движок.ЗагрузитьПравилаОбмена();

		ВызватьИсключениеПриОшибкеДвижкаОбмена(

			Движок,

			НСтр("ru = 'Ошибка при загрузке правил обмена.'"));

		Движок.ОткрытьФайлЗагрузки();

		Движок.ВыполнитьЗагрузку();

		ВызватьИсключениеПриОшибкеДвижкаОбмена(

			Движок,

			НСтр("ru = 'Движок обмена завершил загрузку с ошибками.'"));

		

		Движок.ЗавершитьВедениеПротоколаОбмена();

		

	Исключение

		

		УдалитьВременныеФайлыИКаталоги(ВременныеПути);

		ВызватьИсключение;

		

	КонецПопытки;

	

	УдалитьВременныеФайлыИКаталоги(ВременныеПути);

	

КонецПроцедуры



// +++ Вдовин П.Ю. Протокол движка обмена: детализация ошибок для WS и журнала



Процедура НастроитьПротоколДвижкаОбмена(Движок, ВременныеПути)

	

	ИмяФайлаПротокола = ПолучитьИмяВременногоФайла("txt");

	Движок.ИмяФайлаПротоколаОбмена = ИмяФайлаПротокола;

	// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
	Движок.КодировкаФайлаПротоколаОбмена = "КодировкаТекста.UTF8";
	// --- ВдовинПЮ

	Движок.ИнициализироватьВедениеПротоколаОбмена();

	ВременныеПути.Добавить(ИмяФайлаПротокола);

	

КонецПроцедуры



// Завершает протокол движка, пишет полную ошибку в журнал и выбрасывает бизнес-заголовок.

//

// Параметры:

//   Движок - ОбработкаОбъект.рг_УниверсальныйОбменДаннымиXML - движок обмена.

//   Заголовок - Строка - краткий бизнес-текст для клиента WS.

//   ВременныеПути - Массив - пути временных файлов для удаления.

//   Профиль - СправочникСсылка.рг_НастройкиОбменаXML - профиль для префикса в журнале.

//

Процедура ВызватьИсключениеПриОшибкеДвижкаОбмена(Движок, Заголовок, ВременныеПути = Неопределено, Профиль = Неопределено)

	

	Если НЕ Движок.ФлагОшибки Тогда

		Возврат;

	КонецЕсли;

	

	Движок.ЗавершитьВедениеПротоколаОбмена();

	

	ПолныйТекстОшибки = СформироватьТекстОшибкиДвижкаОбмена(

		Заголовок,

		Движок.ИмяФайлаПротоколаОбмена,

		Движок);

	

	ЗаписатьСобытиеОбмена(

		УровеньЖурналаРегистрации.Ошибка,

		Профиль,

		ПолныйТекстОшибки);

	

	Если ВременныеПути <> Неопределено Тогда

		УдалитьВременныеФайлыИКаталоги(ВременныеПути);

	КонецЕсли;

	

	ВызватьИсключение Заголовок;

	

КонецПроцедуры



Функция СформироватьТекстОшибкиДвижкаОбмена(Заголовок, ИмяФайлаПротокола, Движок)

	

	МаксимальнаяДлина = 8000;

	ФрагментПротокола = ПолучитьФрагментПротоколаОбмена(

		ИмяФайлаПротокола,

		КодировкаПротоколаДвижкаОбмена(Движок));

	

	Если ПустаяСтрока(ФрагментПротокола) Тогда

		Возврат Заголовок;

	КонецЕсли;

	

	ТекстОшибки = Заголовок + Символы.ПС + ФрагментПротокола;

	

	Если СтрДлина(ТекстОшибки) > МаксимальнаяДлина Тогда

		ТекстОшибки = Лев(ТекстОшибки, МаксимальнаяДлина);

	КонецЕсли;

	

	Возврат ТекстОшибки;

	

КонецФункции



Функция ПолучитьФрагментПротоколаОбмена(ИмяФайлаПротокола, КодировкаФайла)

	

	ЧислоСтрокПоУмолчанию = 30;

	

	Если ПустаяСтрока(ИмяФайлаПротокола) Тогда

		Возврат "";

	КонецЕсли;

	

	ФайлПротокола = Новый Файл(ИмяФайлаПротокола);

	

	Если НЕ ФайлПротокола.Существует() Тогда

		Возврат "";

	КонецЕсли;

	

	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаПротокола, КодировкаФайла);

	ТекстПротокола = ЧтениеТекста.Прочитать();

	ЧтениеТекста.Закрыть();

	

	Если ПустаяСтрока(ТекстПротокола) Тогда

		Возврат "";

	КонецЕсли;

	

	СтрокиПротокола = СтрРазделить(ТекстПротокола, Символы.ПС, Ложь);

	ИндексПоследнейОшибки = -1;

	

	Для Индекс = 0 По СтрокиПротокола.ВГраница() Цикл

		

		Если СокрЛП(СтрокиПротокола[Индекс]) = "Ошибка." Тогда

			ИндексПоследнейОшибки = Индекс;

		КонецЕсли;

		

	КонецЦикла;

	

	Если ИндексПоследнейОшибки >= 0 Тогда

		НачальныйИндекс = ИндексПоследнейОшибки;

	Иначе

		НачальныйИндекс = Макс(0, СтрокиПротокола.Количество() - ЧислоСтрокПоУмолчанию);

	КонецЕсли;

	

	Фрагмент = "";

	

	Для Индекс = НачальныйИндекс По СтрокиПротокола.ВГраница() Цикл

		

		Если НЕ ПустаяСтрока(Фрагмент) Тогда

			Фрагмент = Фрагмент + Символы.ПС;

		КонецЕсли;

		

		Фрагмент = Фрагмент + СтрокиПротокола[Индекс];

		

	КонецЦикла;

	

	Возврат Фрагмент;

	

КонецФункции



// +++ Вдовин П.Ю. 29.06.2026 Двухфазный обмен XML: статусы профиля, GetData, ConfirmDataReceipt, правила в хранилище
Функция КодировкаПротоколаДвижкаОбмена(Движок)

	

	ПредставлениеКодировки = СокрЛП(Движок.КодировкаФайлаПротоколаОбмена);

	

	Результат = КодировкаТекста.ANSI;

	Если Не ПустаяСтрока(Движок.КодировкаФайлаПротоколаОбмена) Тогда

		Если СтрНачинаетсяС(ПредставлениеКодировки, "КодировкаТекста.") Тогда

			ПредставлениеКодировки = СтрЗаменить(ПредставлениеКодировки, "КодировкаТекста.", "");

			Попытка

				Результат = КодировкаТекста[ПредставлениеКодировки];

			Исключение

				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(

					НСтр("ru = 'Неизвестная кодировка файла протокола обмена: %1.

					|Используется ANSI.'"),

					ПредставлениеКодировки);

				ЗаписьЖурналаРегистрации(

					"рг.УниверсальныйОбменXML",

					УровеньЖурналаРегистрации.Предупреждение,

					,

					,

					ТекстОшибки);

			КонецПопытки;

		Иначе

			Результат = ПредставлениеКодировки;

		КонецЕсли;

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции
// --- ВдовинПЮ



// --- ВдовинПЮ



Процедура УдалитьВременныеФайлыИКаталоги(Пути)

	

	Для Каждого Путь Из Пути Цикл

		

		Если ПустаяСтрока(Путь) Тогда

			Продолжить;

		КонецЕсли;

		

		УдалитьФайлы(Путь);

		

	КонецЦикла;

	

КонецПроцедуры



// --- ВдовинПЮ



#КонецОбласти
